In [15]:
import numpy as np

import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [3]:
df = pd.read_csv("StudentsPerformance.csv")
df.head()
df.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'mathscore', 'reading score',
       'writing score'],
      dtype='object')

In [7]:
df = df.drop(columns = ['lunch','test preparation course'])

In [8]:
df.head()

,gender,race/ethnicity,parental level of education,mathscore,reading score,writing score
0,female,group B,bachelor's degree,72,72,74
1,female,group C,NaN,69,90,88
2,female,group B,master's degree,90,95,93
3,male,group A,associate's degree,47,57,44
4,male,group C,NaN,76,78,75

In [13]:
df['parenetal level of education'] = df['parental level of education'].fillna("matriculation")

In [14]:
df.head()

,gender,race/ethnicity,parental level of education,mathscore,reading score,writing score,parenetal level of education
0,female,group B,bachelor's degree,72,72,74,bachelor's degree
1,female,group C,NaN,69,90,88,matriculation
2,female,group B,master's degree,90,95,93,master's degree
3,male,group A,associate's degree,47,57,44,associate's degree
4,male,group C,NaN,76,78,75,matriculation

In [ ]:
sns.countplot(data = df , x = 'gender',hue = '')